package com.logic_maker;

public class LogicStore {
	
	private static LogicStore ls = new LogicStore();
	
	private LogicStore() {
		super();
	}
	
	public static LogicStore getInstance() {
		return ls;
	}

	private String[][] crab = {
			{"Å†", "Å°", "Å°", "Å°", "Å†", "Å†", "Å†", "Å†", "Å°", "Å†"},
			{"Å°", "Å°", "Å°", "Å†", "Å†", "Å†", "Å†", "Å†", "Å°", "Å°"},
			{"Å°", "Å°", "Å°", "Å°", "Å†", "Å†", "Å°", "Å°", "Å°", "Å°"},
			{"Å°", "Å°", "Å†", "Å†", "Å†", "Å†", "Å†", "Å°", "Å°", "Å°"},
			{"Å°", "Å†", "Å†", "Å°", "Å†", "Å†", "Å°", "Å†", "Å°", "Å°"},
			{"Å°", "Å°", "Å†", "Å°", "Å°", "Å°", "Å°", "Å†", "Å°", "Å°"},
			{"Å†", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å†"},
			{"Å†", "Å†", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å†", "Å†"},
			{"Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°"},
			{"Å°", "Å†", "Å°", "Å†", "Å†", "Å†", "Å†", "Å°", "Å†", "Å°"}
	};
	
	private String[][] rabbitLogic = {
			{"Å†", "Å°", "Å°", "Å°", "Å†", "Å†", "Å†", "Å†", "Å°", "Å†"},
			{"Å°", "Å°", "Å°", "Å†", "Å†", "Å†", "Å†", "Å†", "Å°", "Å°"},
			{"Å°", "Å°", "Å°", "Å°", "Å†", "Å†", "Å°", "Å°", "Å°", "Å°"},
			{"Å°", "Å°", "Å†", "Å†", "Å†", "Å†", "Å†", "Å°", "Å°", "Å°"},
			{"Å°", "Å†", "Å†", "Å°", "Å†", "Å†", "Å°", "Å†", "Å°", "Å°"},
			{"Å°", "Å°", "Å†", "Å°", "Å°", "Å°", "Å°", "Å†", "Å°", "Å°"},
			{"Å†", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å†"},
			{"Å†", "Å†", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å†", "Å†"},
			{"Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°", "Å°"},
			{"Å°", "Å†", "Å°", "Å†", "Å†", "Å†", "Å†", "Å°", "Å†", "Å°"}
	};

	public String[][] getCrab() {
		return crab;
	}

	public String[][] getRabbitLogic() {
		return rabbitLogic;
	}
	
	
}
